Tekla Open API Reference for Tekla Structures 2025
ModelAccess.ConnectToModel Method
Overload List
Name | Description
ConnectToModel()
 Gets a model connnection.
ConnectToModel(Boolean)
 Gets a model connection.
ConnectToModel(Model)
 Gets a model connection.
Top
See Also
Reference
ModelAccess Class
Tekla.Structures.Dialog.UIControls Namespace